
## Plan Result (stg)




<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_resource_group.sct-resource-management
  * module.key_vault.azurerm_key_vault.kv
  * module.key_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.key_vault.azurerm_key_vault_access_policy.developer[0]
  * module.key_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.sct-resource-management will be created
  + resource "azurerm_resource_group" "sct-resource-management" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "sct-stg"
      + tags     = {
          + "application"         = "sct-rm"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/sct-resource-management-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#sct-resource-management"
          + "environment"         = "staging"
          + "managedBy"           = "DTS SCT Resource Management"
        }
    }

  # module.key_vault.azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                   = (known after apply)
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "sct-stg"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "sct-stg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "application"         = "sct-rm"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/sct-resource-management-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#sct-resource-management"
          + "environment"         = "staging"
          + "managedBy"           = "DTS SCT Resource Management"
        }
      + tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                       = (known after apply)

      + contact (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.key_vault.azurerm_key_vault_access_policy.creator_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      + certificate_permissions = [
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "List",
          + "Get",
          + "Delete",
          + "Update",
          + "Import",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
          + "GetRotationPolicy",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01"
      + secret_permissions      = [
          + "Set",
          + "List",
          + "Get",
          + "Delete",
          + "Recover",
          + "Purge",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.key_vault.azurerm_key_vault_access_policy.developer[0] will be created
  + resource "azurerm_key_vault_access_policy" "developer" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.key_vault.azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "42cba74a-266b-44a7-86b4-9683b39dfc6b"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "sct-stg"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "AuditEvent"
            # (1 unchanged attribute hidden)
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.sct-resource-management has been deleted
  - resource "azurerm_resource_group" "sct-resource-management" {
        id         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/sct-stg"
      - name       = "sct-stg" -> null
        tags       = {
            "application"         = "sct-rm"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/sct-resource-management-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#sct-resource-management"
            "environment"         = "staging"
            "managedBy"           = "DTS SCT Resource Management"
        }
        # (2 unchanged attributes hidden)
    }

  # module.key_vault.azurerm_key_vault.kv has been deleted
  - resource "azurerm_key_vault" "kv" {
      - id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/sct-stg/providers/Microsoft.KeyVault/vaults/sct-stg" -> null
      - name                            = "sct-stg" -> null
        tags                            = {
            "application"         = "sct-rm"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/sct-resource-management-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#sct-resource-management"
            "environment"         = "staging"
            "managedBy"           = "DTS SCT Resource Management"
        }
      - vault_uri                       = "https://sct-stg.vault.azure.net/" -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":3,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->